{"How to craft 4 oak planks in Minecraft?": "Answer: To craft 4 oak planks in Minecraft, you'll need to place 2 oak logs vertically in the crafting table. This will yield 4 oak planks. You can then use those planks to craft other items!\n", "How to craft a crafting table in Minecraft?": "Answer: To craft a crafting table in Minecraft, you need 4 planks of wood. You can obtain planks by breaking down wood logs with your hand or any tool. Then, open your inventory and place the 4 planks in a 2x2 square to craft the crafting table.\n", "How to obtain a wood log in Minecraft?": "Answer: To obtain a wood log in Minecraft, you need to break down a tree. Here's how:\n\n1.  **Find a Tree:** Locate any type of tree in the game world.\n2.  **Equip Your Hand:** Make sure your hand is empty.\n3.  **Target the Wood:** Aim at the wooden trunk of the tree.\n4.  **Break the Block:** Hold down the left mouse button (or the equivalent button on your console/mobile device) to break the wood block. You're aiming to get a \"Wood Log\" item.\n5.  **Collect the Logs:** The wood logs will drop as items that you can pick up.\n\nYou'll need wood logs to craft basic tools and other essential items in the game.", "How to craft a wooden pickaxe in Minecraft?": "Answer: To craft a wooden pickaxe in Minecraft, you'll need:\n\n*   **2 Sticks:** Obtained by breaking down a wooden plank.\n*   **3 Wooden Planks:** Obtained by breaking down wood logs (Oak, Spruce, Birch, Jungle, Acacia, Dark Oak, Mangrove).\n\nHere's the crafting recipe:\n\n1.  Open your crafting table (or your inventory if you're using your inventory crafting grid).\n2.  Place the materials in the following pattern:\n\n    *   Top Row: Wood Plank, Wood Plank, Wood Plank\n    *   Middle Row: Empty, Stick, Empty\n    *   Bottom Row: Empty, Stick, Empty\n\nThis will create a Wooden Pickaxe.\n", "How to obtain 2 sticks in Minecraft?": "Answer: You can obtain sticks in Minecraft by breaking leaves from trees. Each leaf block broken yields 1-4 sticks. You're likely to get more than 2 sticks with just a few leaf blocks. You can also craft sticks by placing two wooden planks in the crafting table, which yields four sticks."}